class AppString {
  static const String d0 =
      " للهم إني أسألك باسمك الحسيب الكافي أن تكفني كل أموري من جليل وحقير مما يشوش خاطري يا كافي.";

  static const String d2 = " "
      "اللهم إني أسألك فرجاً قريباً، وصبراً جميلاً، ورزقاً واسعاً، والعافية من البلايا، وشكر العافية والشكر عليها، وأسألك الغنى من الناس ولاحول ولا قوة إلا بالله العلي العظيم.";

  static const String d3 =
      " اللهم صلّ على سيدنا محمد وعلى آل سيدنا محمد، اللهم إني أسألك بحق السائلين، وبأسمائك العظمى والحسنى أن تكفني شر ما أخاف وأحذر فإنك تكفي ذلك الأمر";

  static const String d4 =
      " اللهم لا طاقة لي بالجهد ولا قوة لي على البلاء، فلا تحرمني العافية والرزق ولا تكلني إلى خلقك بل تفرد لي بحاجتي وتولني برحمتك، فإنك إن وكلتني إلى نفسي عجزت عنها، وإن وكلتني إلى خلقك ظلموني وحرموني وقهروني ومنوا علي، فبفضلك يا الله أغنني، وابسط لي، واكفني، وخلصني واجعل رضاي فيما يرد علي منك، وبارك لي فيما رزقتني وفيما خولتني واجعلني في كل حالاتي محفوظ مجار، واقضِ عني كل ما علي لك في وجه من وجوه طاعتك أو لخلقك، فأنت تعلم عظم ضعفي وكثرة ذنوبي وضعف بدني وقوتي وغفلتي، فأدي ما لهم علي عندك يا عظيم فإنك واسع كريم.";

  static const String d5 =
      "يا رب ترى ضعفي وقلة حيلتي، فإني ضعيف ذليل متضرع إليك مستجير بك من كل بلاء، مستتر بك فاسترني يا مولاي مما أخاف وأحذر وأنت أعظم من كل عظيم، بك استترت يا الله. اللهم إني أسألك مغفرة تشرح بها صدري وترفع بها ذكري وتيسر بها أمري وتكشف بها ضري وترفعه بها إنك على كل شيء قدير.";

  static const String d6 =
      " اللهم يا حيّ يا محيي، يا كافي يا كريم، أجرني في مصيبتي بالرضى والعفو والعافية، والمعافاة الدائمة، في الدنيا والآخرة، والعوض الصالح في الزوج، والأهل والجسد والمال والأصحاب والعمل والذرية، إنك على كل شيء قدير، وارحمني برحمتك واكشف ما نزل بي من ضر، وخلفني خلاصاً جميلاً عاجلاً غير آجل.";

  static const String d7 =
      " اللهم يا فارج الهم ويا كاشف الغم، مجيب دعوة المضطرين، رحمن الدنيا والآخرة ورحيمهما، ارحمني رحمة من عندك تغني بها عن رحمة من سواك، اللهم اكشف ضري يا مفرج الهموم، لا إله إلا أنت سبحانك إني كنت من الظالمين";

  static const String d8 =
      "اللهم يا حابس يد إبراهيم عن ذبح ابنه، ويا رافع شأن يوسف على إخوته وأهله، ويا راحم عبرة داود وكاشف ضر أيوب، يا مجيب دعوة المضطرين، وكاشف غم المغمومين، أسألك أن تجيب دعائي وتكشف غمّي وهمّي يا رب العالمين. ";

  static const String d9 =
      " يا فارج الغم اجعل لي من أمري فرجاً ومخرجاً، يا سامع كل شكوى وكاشف كل كرب، أدعوك يا إلهي دعاء من اشتدت فاقته، وضعفت قوته، وقلت حيلته، دعاء الملهوف المكروب الذي لا يجد كشف ما نزل به غيرك.";

  static const String d10 =
      " يا مجيب دعوة المضطرين، اللهم فرج عني ما ضاق به صدري، وعجز معه صبري، وقلت فيه حيلتي، وضعفت له قوتي، تحصنت بعزتك وعظمتك وبجلالك.";

  static const String d11 =
      "     عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال: ((مَن نفَّس عن مؤمنٍ كربةً من كُرَب الدنيا، نفَّس الله عنه كربةً من كُرَب يوم القيامة، ومن يسَّر على معسرٍ، يسَّر الله عليه في الدنيا والآخرة، ومن ستر مسلمًا ستره الله في الدنيا والآخرة، واللهُ في عون العبد ما كان العبد في عون أخيه، ومن سلك طريقًا يلتمس فيه علمًا، سهَّل الله له به طريقًا إلى الجنة، وما اجتمع قومٌ في بيتٍ من بيوت الله يتلون كتاب الله ويتدارسونه بينهم، إلا نزلت عليهم السكينة، وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده، ومن بطَّأ به عمله";

  static const String d12 =
      " دعاء تفريج الهموم والمشاكل اللهم رحمتك أرجو، فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله، لا إله إلا أنت ";

  static const String d13 =
      "يا رب أسألك نعيمًا لا ينفد وأسألك قرةَ عينٍ لا تنقطع، وأسألك الرضا بالقضاءِ، أسألك بَرْدَ العيْشِ بعدَ الموتِ. مولاي إني أسألك لذَّةَ النظرِ إلى وجهِك، والشوقَ إلى لقائِك، في غيرِ ضرَّاءَ مضرةٍ، ولا فتنةٍ مضلَّةٍ. اللهمَّ زيِّنا بزينةِ الإيمانِ، واجعلْنا هداةً مهتدينَ.";

  static const String d14 = " اللهُ؛ اللهُ ربي ، لا أُشركُ به شيئًا";

  static const String d15 =
      " أعوذ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ، اللَّهمَّ أَنْتَ الْأوََّل فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَي";

  static const String d16 =
      " أللهم إني أعوذ بك من جَهْدِ البلاءِ ودركِ الشقاءِ وسوءِ القضاءِ وشماتةِ الأعداءِ";

  static const String d17 =
      " اللَّهمَّ إنِّي أعوذُ   بِكَ من زَوالِ نعمتِكَ، وتحويلِ عافَيتِكَ، وفُجاءةِ نقمتِكَ، وجميعِ سُخْطِكَ ";

  static const String d18 =
      "لا إلَهَ إلَّا اللَّهُ العَظِيمُ الحَلِيمُ، لا إلَهَ إلَّا اللَّهُ رَبُّ السَّمَوَاتِ والأرْضِ، ورَبُّ العَرْشِ العَظِيم ";

  static const String d19 =
      " اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى وَمنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفرْقَانِ.";

  static const String d20 =
      "    للهم اجعل محبتك صلتي بخلقك، ونورك بصيرتي لرؤية ملكوتك، والتبصّر بدلائل وجودك في كل شيء";

  static const String d21 =
      "    للهمَّ إني عبدُك وابنُ عبدِك وابنُ أَمَتِك ناصيتي بيدِك ماضٍ فيَّ حكمُك عَدْلٌ فيَّ قضاؤُك أسألُك بكلِّ اسمٍ هو لك سميتَ به نفسَك أو أنزلتَه في كتابِك أو علَّمتَه أحدًا مِنْ خلقِك أو استأثرتَ به في علمِ الغيبِ عندَك أنْ تجعلَ القرآنَ ربيعَ قلبي ونورَ صدري وجلاءَ حُزْني وذَهابَ هَمِّي";

  static const String d22 =
      "(اللَّهمَّ اكفِني بحلالِك عن حرامِك واغنِني بفضلِك عمَّن سواك).[١] (اللَّهمَّ ربَّ السَّمواتِ السَّبعِ، وربَّ العرشِ العظيمِ، ربَّنا وربَّ كلِّ شيءٍ، أنتَ الظَّاهرُ فليس فوقَكَ شيءٌ، وأنتَ الباطنُ فليس دونَكَ شيءٌ، مُنزِلَ التَّوراةِ، والإنجيلِ، والفُرقانِ، فالقَ الحَبِّ والنَّوى، أعوذُ بكَ مِن شرِّ كلِّ شيءٍ أنتَ آخِذٌ بناصيتِه، أنتَ الأوَّلُ فليس قبْلَكَ شيءٌ، وأنتَ الآخِرُ فليس بعدَكَ شيءٌ، اقضِ عنَّا الدَّينَ وأَغْنِنا مِن الفقرِ";

  static const String d23 =
      "ويستحب أن نقول في دعاء تفريج الهموم والمشاكل  اللهم لا طاقة لي بالجهد ولا قوة لي على البلاء، فلا تحرمني العافية والرزق ولا تكلني إلى خلقك بل تفرد لي بحاجتي وتولني برحمتك، فإنك إن وكلتني إلى نفسي عجزت عنها، وإن وكلتني إلى خلقك ظلموني وحرموني وقهروني ومنوا علي، فبفضلك يا الله أغنني، وابسط لي، واكفني، وخلصني واجعل رضاي فيما يرد علي منك، وبارك لي فيما رزقتني وفيما خولتني واجعلني في كل حالاتي محفوظ مجار، واقضِ عني كل ما علي لك في وجه من وجوه طاعتك أو لخلقك، فأنت تعلم عظم ضعفي  ذنوبي وضعف بدني وقوتي وغفلتي، فأدي ما لهم علي عندك يا عظيم فإنك واسع كريم";

  static const String d24 =
      "اللهمَّ مالكَ الملكِ تُؤتي الملكَ مَن تشاءُ ، وتنزعُ الملكَ ممن تشاءُ ، وتُعِزُّ مَن تشاءُ ، وتذِلُّ مَن تشاءُ ، بيدِك الخيرُ إنك على كلِّ شيءٍ قديرٌ . رحمنُ الدنيا والآخرةِ ورحيمُهما ، تعطيهما من تشاءُ ، وتمنعُ منهما من تشاءُ ، ارحمْني رحمةً تُغنيني بها عن رحمةِ مَن سواك";

  static const String d25 =
      "    في سنن أبي داود وسنن ابن ماجه، من حديث أسماء بنت عميس، قالت: قال لي رسول الله صلّى الله عليه وسلّم: ألا أعلّمك كلمات تقولينهن عند الكرب أو في الكرب: الله، الله ربّي لا أشرك به شيئًا.";

  static const String d26 =
      "  اللَّهمَّ إنِّي أعوذُ بِكَ منَ الْهدمِ ، وأعوذُ بِكَ منَ التَّردِّي ، وأعوذُ بِكَ منَ الغرَقِ والحريقِ ، وأعوذُ بِكَ أن يتخبَّطني الشَّيطانُ عندَ الموتِ ، وأعوذُ بِكَ أن أموتَ في سبيلِكَ مُدبرًا وأعوذُ بِكَ أن أموتَ لديغًا";

  static const String d27 =
      "اللهم يا رازق السائلين، يا راحم المساكين، ويا ذا القوة المتين، ويا خير الناصرين، يا ولي المؤمنين، يا غيّاث المستغيثين، إياك نعبد وإيّاك نستعين، اللهم إني أسألك رزقًا واسعًا طيبًا من رزقك.";

  static const String d28 =
      " يا مقيل العثرات، يا قاضي الحاجات، اقض حاجتي، وفرج كربتي، وارزقني من حيث لا أحتسب. ";

  static const String d29 =
      "   اللهم ارزقني رزقًا واسعًا حلالًا طيبًا من غير كدٍّ، واستجب دعائي من غير رد، وأعوذ بك من الفقر والدّين، اللهم يا رازق السائلين، يا راحم المساكين، ويا ذا القوة المتين، ويا خير الناصرين، يا ولي المؤمنين، يا غيّاث المستغيثين، إياك نعبد وإيّاك نستعين. الحمد لله الذي تواضع كل شيء لعظمته، الحمد لله الذي استسلم كل شيء لقدرته، الحمد لله الذي ذلّ كل شيء لعزته، الحمد لله الذي خضع كل شيء لملكه.  ";

  static const String d30 =
      "   اللّهم إن كان رزقي في السّماء فأنزله، وإن كان في الأرض فأخرجه، وإن كان بعيدًا فقرّبه، وإن كان قريبًا فيسّره، وإن كان قليلًا فكثّره، وإن كان كثيرًا فبارك لي فيه";

  static const String d31 =
      "اللهم رب السموات السبع، ورب العرش العظيم، اقض عنا الدين وأغننا من الفقر.";

  static const String d32 =
      " اللهم صل علي سيدنا محمد، وعلى آل محمد، يا ذا الجلال والإكرام، يا قاضي الحاجات، يا أرحم الراحمين، يا حي يا قيوم، لا إله إلا أنت الملك الحق المبين.  ";

  static const String d33 =
      "   اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك  ";

  static const String d34 =
      " يا الله، يا رب، يا حي يا قيوم، يا ذا الجلال والإكرام، أسألك باسمك العظيم الأعظم أن ترزقني رزقًا واسعًا حلالًا طيبًا، برحمتك يا أرحم الراحمين. ";

  static const String d35 =
      "  «اللهم ارزقني رزقًا واسعًا حلالًا طيبًا من غير كدٍّ، واستجب دعائي من غير رد، وأعوذ بك من الفقر والدّين، اللهم يا رازق السائلين، يا راحم المساكين، ويا ذا القوة المتين، ويا خير الناصرين، يا ولي المؤمنين، يا غيّاث المستغيثين، إياك نعبد وإيّاك نستعين ";

  static const String d36 =
      " اللهم ارزقني رزقًا واسعًا حلالًا طيبًا، واستجب دعائي من غير رد، وأعوذ بك من الفضيحتين؛ الفقر والدين، اللهم يا رازق السائلين، ويا راحم المساكين، يا ذا القوة المتين، ويا ولي المؤمنين، ويا خير الناصرين، يا غياث المستغيثين، ارزقني يا أرحم الراحمين";

  static const String d37 =
      "«اللهم ارزقنا التوفيق، وزدنا علمًا وعملًا صالحًا، واجعلنا من المتقين المخلصين، اللهم إني توكلت عليك وسلمت أمري إليك، لا ملجأ ولا منجى منك إلا إليك» ";

  static const String d38 =
      "اللهم افتح لنا خزائن رحمتك، اللهم رحمة لا تعذبنا بعدها في الدنيا والآخرة، وارزقنا من فضلك الواسع رزقًا حلالًا طيبًا، ولا تحوجنا ولا تفقرنا إلى أحد سواك، وزدنا لك شكرًا، وإليك فقرًا، وبك عمّن سواك غنىً وتعفّفًا».  ";

  static const String d39 =
      " «اللهم سخر لي جميع خلقك كما سخرت البحر لسيدنا موسى -عليه السلام- وألن لي قلوبهم كما ألنت الحديد لداود -عليه السلام- فإنهم لا ينطقون إلا بإذنك، نواصيهم في قبضتك، وقلوبهم في يديك تصرفها كيف شئت، يا مقلب القلوب ثبت قلبي على دينك، يا علام الغيوب أطفأت غضبهم بلا إله إلا الله، واستجلبت محبتهم»  ";

  static const String d40 =
      "اللهم انك تعلم بحالي فـ ازرقني من حيث لا اعلم ويسر لي اموري ";

  static const String d41 =
      " اللهم يانور هذا الكون ,,ياعون من يطلب العون,أكتب لنا رضاك ,و أكفنا بك عمن سواك و أسعدنا بعفوك يوم لقائك يارب فوضت أموري إليك و توكلت عليك ف يارب أجبرني و عافني و ازرقني و اغفر لي و ارحمني و تولني يارب فيمن توليت يا كريم  ";

  static const String d42 =
      'اللهم أعني علي تقواك و وفقني و ارزقنى الحلال و يسر لي أمري يا كريم';
  static const String d43 =
      "اللهم فرج كربي و يسر لي أمري و ارزقني ما اتمنى، صباح الرضا ";

  static const String d44 =
      " اللهم أرزقني خير الأيام القادمة و حقق لي ما أتمنى و أرح بالي و يسر لي أمري";

  static const String d45 =
      "ا للهم أنت أعلم بما في صدري يارب يسر لي أمري و فرج همي و ارزقني راحة البال";

  static const String d46 =
      " للهم أعني، ربي سهل علي كل ما هو ات،يارب يسر لي جميع أموري و إجعل الخيرة فيما أخترت لي و أرزقني بما تمنيت، ربي في تدبيرك مايغني عن الحيل،وفي كرمك ماهو فوق الأمل،وفي حلمك مايسد الخلل، وفي عفوك مايمحو الزلل، ربي فبقوة تدبيرك وعظيم عفوك إصلح امري كله يارب وكل من قال امين.";

  static const String d47 =
      " يا رب يسر لي امري و ارزقني التوفيق و الرضا و بارك لي في علمي اللهم اني اسألك الجنة و ما قرب إليها من قول او عمل و اعوذ بك من النار من قول او عمل، اللهم اغفر لموتانا و موتى المسلمين و ارحمهم و ارزقهم الجنة";

  static const String d48 =
      " اللهم أرزقني مستقبلا افضل مما اطمح يارب ليس بجدي ولا اجتهادي انما بتوفيقك وبركتك رب اشرح لي صدري و يسر لي أمري و وفقني.";

  static const String d49 =
      " يا رب سخر لى جنود الارض و ملائكه السماء و كل من وليته امرى و ارزقنى حظ الدنيا و نعيم الاخرة و يسر لى كل امر عسير و قل لما أريد كن ليكون بحولك و قوتك و رحمتك، اللهم ارنا عجائب قدرتك فى قضاء حوائجنا و اؤزقنا من حيث لا نحتسب و اجبرنا جبرا يتعجب له اهل السموات و الارض.   ";
  static const String d50 =
      " اللهم وفقني و يسر امري و ارزقني و اكرمني و اعفوا عني و اغفر لي و ابعد عني ما يضرني و يحززني و قربني إليك يارب و المسلمين اجمعين. ";
  static const String d51 = ' اللهم يا مغيّر الأحوال غيّر حالي إلى أحسن حال ، و سخر لي من حظوظ الدنيا ما تعلم أنه خير لي و اصرف عني كل ما هو شر لي إنك على كل شيءٍ قدير . ';
  static const String d52 =
      ' كَانَ رَسُولُ اللَّهِ ﷺ يُكْثِرُ أَنْ يَقُولَ: "اللَّهُمَّ يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ، اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قَلْبِي علَى طَاعَتِكَ';


  static const String d53 = 'اللهم استرنا وارحمنا برحمتك وارزقنا حسن الخاتمة وتوفنا ونحن مسلمين واجعلنا من عبادك الصالحين والشاكرين لا اله إلا أنت سبحانك اني كنت من الظالمين';
}


List<String> list = [
  AppString.d0,
  AppString.d2,
  AppString.d3,
  AppString.d4,
  AppString.d5,
  AppString.d6,
  AppString.d7,
  AppString.d8,
  AppString.d9,
  AppString.d10,
  AppString.d11,
  AppString.d12,
  AppString.d13,
  AppString.d14,
  AppString.d15,
  AppString.d16,
  AppString.d17,
  AppString.d18,
  AppString.d19,
  AppString.d20,
  AppString.d21,
  AppString.d22,
  AppString.d23,
  AppString.d24,
  AppString.d25,
  AppString.d26,
  AppString.d27,
  AppString.d28,
  AppString.d29,
  AppString.d30,
  AppString.d31,
  AppString.d32,
  AppString.d33,
  AppString.d34,
  AppString.d35,
  AppString.d36,
  AppString.d37,
  AppString.d38,
  AppString.d39,
  AppString.d40,
  AppString.d41,
  AppString.d42,
  AppString.d43,
  AppString.d44,
  AppString.d45,
  AppString.d46,
  AppString.d47,
  AppString.d48,
  AppString.d49,
  AppString.d50,
  AppString.d51,
  AppString.d52,
  AppString.d53,

];

List<String> listAssma = ['  الله'];
// الله ربي لا اشرك به شي